import React, { useState } from 'react'

export default function About() {
    const [myStyle, setmyStyle] = useState({
        color: "black",
        backgroundColor: "white"
    })
    const [btnTxt, setbtnTxt] = useState("Enable Darkmode");
    const DarkClick = () => {
        if (myStyle.color === "white") {
            setmyStyle({
                color: "black",
                backgroundColor: "white"
            })
            setbtnTxt("Enable Darkmode")
        }
        else {
            setmyStyle({
                color: "white",
                backgroundColor: "black"
            })
            setbtnTxt("Enable Litemode")
        }
    }


    return (

        <div className='container' style={myStyle}>
            <h2> About Us </h2>
            <div className="accordion" id="accordionExample">
                <div className="accordion-item">
                    <h2 className="accordion-header">

                    </h2>
                    <div id="collapseOne" className="accordion-collapse collapse show" data-bs-parent="#accordionExample">
                        <div className="accordion-body">
                            <strong>सचिन रमेश तेंडुलकर  Sachin Tendulkar,</strong> सचिन रमेश तेंडुलकर  Sachin Tendulkar, जन्म: 24 अप्रैल 1973) क्रिकेट के इतिहास में विश्व के सर्वश्रेष्ठ बल्लेबाज़ में माने जाते हैं। भारत के सर्वोच्च नागरिक सम्मान भारत रत्न से सम्मानित होने वाले वह सर्वप्रथम खिलाड़ी और सबसे कम उम्र के व्यक्ति हैं। राजीव गांधी खेल रत्न पुरस्कार से सम्मानित होने वाले पहले क्रिकेट खिलाड़ी हैं। सन् २००८ में वे पद्म विभूषण से भी पुरस्कृत किये जा चुके है।

                            सन् १९८९ में अन्तर्राष्ट्रीय क्रिकेट में पदार्पण के पश्चात् उन्होंने बल्लेबाजी में भी कई कीर्तिमान स्थापित किए हैं। उन्होंने टेस्ट व एक दिवसीय क्रिकेट, दोनों में सर्वाधिक शतक अर्जित किये हैं। वे टेस्ट क्रिकेट में सबसे ज़्यादा रन बनाने वाले बल्लेबाज़ हैं। इसके साथ ही टेस्ट क्रिकेट में १४००० से अधिक रन बनाने वाले वह विश्व के एकमात्र खिलाड़ी हैं। एकदिवसीय मैचों में भी उन्हें कुल सर्वाधिक रन बनाने का कीर्तिमान प्राप्त है।  उन्होंने अपना पहला प्रथम श्रेणी क्रिकेट मैच मुम्बई के लिये १४ वर्ष की आयु में खेला था। उनके अन्तर्राष्ट्रीय खेल जीवन की शुरुआत १९८९ में पाकिस्तान के विरुद्ध कराची से हुई।

                            2001 में, सचिन तेंदुलकर अपनी 259 पारी में 10,000 ओडीआई रन पूरा करने वाले पहले बल्लेबाज बने। बाद में अपने करियर में, तेंदुलकर भारतीय दल का हिस्सा थे जिन्होंने २०११ क्रिकेट विश्व कप जीता, भारत के लिए छह विश्व कप के प्रदर्शन में उनकी पहली जीत। दक्षिण अफ्रीका में आयोजित टूर्नामेंट के 2003 संस्करण में उन्हें पहले "प्लेयर ऑफ द टूर्नामेंट" नाम दिया गया था। 2013 में, वे विस्डेन क्रिकेटर्स के अल्मनैक की 150 वीं वर्षगांठ को चिह्नित करने के लिए नामित एक अखिल भारतीय टेस्ट वर्ल्ड इलेवन में शामिल एकमात्र भारतीय क्रिकेटर थे। सचिन क्रिकेट जगत के सर्वाधिक प्रायोजित खिलाड़ी हैं और विश्व भर में उनके अनेक प्रशंसक हैं। उनके प्रशंसक उन्हें प्यार से भिन्न-भिन्न नामों से पुकारते हैं जिनमें सबसे प्रचलित लिटिल मास्टर व मास्टर ब्लास्टर है। क्रिकेट के अलावा वह अपने ही नाम के एक सफल रेस्टोरेंट के स्वामी  भी हैं।

                            सचिन तेंदुलकर भूतपूर्व राज्य सभा सांसद भी रह चुके हैं। सन् २०१२ में उन्हें राज्य सभा के सदस्य के रूप में नामित किया गया था।

                            क्रिकेट के भगवान कहे जाने वाले सचिन तेंदुलकर पर एक बायोपिक फिल्म ‘सचिन : ए बिलियन ड्रीम्स’ बनाई जा चुकी है। इस फ़िल्म का टीज़र भी बहुत रोमांचक हैं। टीजर में सचिन को उन्हीं की कहानी सुनाते हुए देखेंगे जो एक शरारती बच्चे से एक हीरो बनकर उभरता है। ख़ुद सचिन तेंदुलकर का भी ये मानना है कि क्रिकेट खेलने से अधिक चुनौतीपूर्ण अभिनय करना है। सचिन – ए बिलियन ड्रीम्स’ का निर्माण श्रीकांत भासी और रवि भगचंदका ने किया है और इसका निर्देशन जेम्स अर्सकिन ने।

                            सचिन ने 14 साल की आयु में क्रिकेट खेलना शुरू किया था
                        </div>
                    </div>
                </div>
                <div className='my-4'>
                    <button className="btn btn-primary" onClick={DarkClick}>{btnTxt}</button>
                </div>
            </div>
            
        </div>
    )
}

